siva100403/CHEWIE_ASBV21/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for GPIO3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for GPIO4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    gpio_pin_config_t ASB_HMI_INT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 86)  */
    GPIO_PinInit(BOARD_INITPINS_ASB_HMI_INT_GPIO, BOARD_INITPINS_ASB_HMI_INT_PIN, &ASB_HMI_INT_config);

    gpio_pin_config_t LED_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN, &LED_B_config);

    gpio_pin_config_t LED_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN, &LED_G_config);

    gpio_pin_config_t LED_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN, &LED_R_config);

    gpio_pin_config_t LID_ONOFF_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_LID_ONOFF_CTRL_GPIO, BOARD_INITPINS_LID_ONOFF_CTRL_PIN, &LID_ONOFF_CTRL_config);

    gpio_pin_config_t SPARE2_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_4 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_SPARE2_CTRL_GPIO, BOARD_INITPINS_SPARE2_CTRL_PIN, &SPARE2_CTRL_config);

    gpio_pin_config_t LID_REV_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_LID_REV_CTRL_GPIO, BOARD_INITPINS_LID_REV_CTRL_PIN, &LID_REV_CTRL_config);

    gpio_pin_config_t SPARE1_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_SPARE1_CTRL_GPIO, BOARD_INITPINS_SPARE1_CTRL_PIN, &SPARE1_CTRL_config);

    gpio_pin_config_t SHD_ONOFF_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_SHD_ONOFF_CTRL_GPIO, BOARD_INITPINS_SHD_ONOFF_CTRL_PIN, &SHD_ONOFF_CTRL_config);

    gpio_pin_config_t SHD_DIR_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_SHD_DIR_CTRL_GPIO, BOARD_INITPINS_SHD_DIR_CTRL_PIN, &SHD_DIR_CTRL_config);

    gpio_pin_config_t HEATER_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_HEATER_CTRL_GPIO, BOARD_INITPINS_HEATER_CTRL_PIN, &HEATER_CTRL_config);

    gpio_pin_config_t RTC_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_RTC_INT_GPIO, BOARD_INITPINS_RTC_INT_PIN, &RTC_INT_config);

    gpio_pin_config_t LS_SENSE_LIDOPEN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_LS_SENSE_LIDOPEN_GPIO, BOARD_INITPINS_LS_SENSE_LIDOPEN_PIN, &LS_SENSE_LIDOPEN_config);

    gpio_pin_config_t LS_SENSE_LIDCLOSE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_LS_SENSE_LIDCLOSE_GPIO, BOARD_INITPINS_LS_SENSE_LIDCLOSE_PIN, &LS_SENSE_LIDCLOSE_config);

    gpio_pin_config_t LS_DRIVE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_7 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_LS_DRIVE_GPIO, BOARD_INITPINS_LS_DRIVE_PIN, &LS_DRIVE_config);

    gpio_pin_config_t LS_SENSE_FLAP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_2 (pin 50)  */
    GPIO_PinInit_Port5(BOARD_INITPINS_LS_SENSE_FLAP_GPIO, BOARD_INITPINS_LS_SENSE_FLAP_PIN, &LS_SENSE_FLAP_config);

    gpio_pin_config_t LS_SENSE_ST_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_3 (pin 51)  */
    GPIO_PinInit_Port5(BOARD_INITPINS_LS_SENSE_ST_GPIO, BOARD_INITPINS_LS_SENSE_ST_PIN, &LS_SENSE_ST_config);

