siva100403/CHEWIE_ASBV21/board/pin_mux.c
    /* PORT0_16 (pin 84) is configured as FC0_P0 */
    PORT_SetPinMux(BOARD_INITPINS_UART_RXD_HMI_PORT, BOARD_INITPINS_UART_RXD_HMI_PIN, kPORT_MuxAlt2);

    PORT0->PCR[16] = ((PORT0->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_17 (pin 85) is configured as FC0_P1 */
    PORT_SetPinMux(BOARD_INITPINS_UART_TXD_HMI_PORT, BOARD_INITPINS_UART_TXD_HMI_PIN, kPORT_MuxAlt2);

    PORT0->PCR[17] = ((PORT0->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_18 (pin 86) is configured as PIO0_18 */
    PORT_SetPinMux(BOARD_INITPINS_ASB_HMI_INT_PORT, BOARD_INITPINS_ASB_HMI_INT_PIN, kPORT_MuxAlt0);

    PORT0->PCR[18] = ((PORT0->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_20 (pin 88) is configured as FC1_P0 */
    PORT_SetPinMux(BOARD_INITPINS_UART_RXD_DBG_PORT, BOARD_INITPINS_UART_RXD_DBG_PIN, kPORT_MuxAlt3);

    PORT0->PCR[20] = ((PORT0->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_21 (pin 89) is configured as FC1_P1 */
    PORT_SetPinMux(BOARD_INITPINS_UART_TXD_DBG_PORT, BOARD_INITPINS_UART_TXD_DBG_PIN, kPORT_MuxAlt3);

    PORT0->PCR[21] = ((PORT0->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_22 (pin 90) is configured as PIO0_22 */
    PORT_SetPinMux(BOARD_INITPINS_LED_B_PORT, BOARD_INITPINS_LED_B_PIN, kPORT_MuxAlt0);

    PORT0->PCR[22] = ((PORT0->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_23 (pin 91) is configured as PIO0_23 */
    PORT_SetPinMux(BOARD_INITPINS_LED_G_PORT, BOARD_INITPINS_LED_G_PIN, kPORT_MuxAlt0);

    PORT0->PCR[23] = ((PORT0->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_0 (pin 92) is configured as PIO1_0 */
    PORT_SetPinMux(BOARD_INITPINS_LED_R_PORT, BOARD_INITPINS_LED_R_PIN, kPORT_MuxAlt0);

    PORT1->PCR[0] = ((PORT1->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK)))

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_3 (pin 17) is configured as PIO2_3 */
    PORT_SetPinMux(BOARD_INITPINS_LID_ONOFF_CTRL_PORT, BOARD_INITPINS_LID_ONOFF_CTRL_PIN, kPORT_MuxAlt0);

    PORT2->PCR[3] = ((PORT2->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_4 (pin 18) is configured as PIO2_4 */
    PORT_SetPinMux(BOARD_INITPINS_SPARE2_CTRL_PORT, BOARD_INITPINS_SPARE2_CTRL_PIN, kPORT_MuxAlt0);

    PORT2->PCR[4] = ((PORT2->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_1 (pin 74) is configured as FC6_P0 */
    PORT_SetPinMux(BOARD_INITPINS_I2C_EEPROM_SDA_PORT, BOARD_INITPINS_I2C_EEPROM_SDA_PIN, kPORT_MuxAlt2);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin 65) is configured as PIO3_12 */
    PORT_SetPinMux(BOARD_INITPINS_LID_REV_CTRL_PORT, BOARD_INITPINS_LID_REV_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 64) is configured as PIO3_13 */
    PORT_SetPinMux(BOARD_INITPINS_SPARE1_CTRL_PORT, BOARD_INITPINS_SPARE1_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_14 (pin 63) is configured as PIO3_14 */
    PORT_SetPinMux(BOARD_INITPINS_SHD_ONOFF_CTRL_PORT, BOARD_INITPINS_SHD_ONOFF_CTRL_PIN, kPORT_MuxAlt0);

    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

